stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_pwr.h
/* Private macros ------------------------------------------------------------*/

/** @addtogroup PWR_Private_Macros PWR Private Macros
  * @{
  */

/* Stop mode entry check macro */
#define IS_PWR_REGULATOR(REGULATOR)  (((REGULATOR) == PWR_LOWPOWERMODE_STOP0) || \
                                      ((REGULATOR) == PWR_LOWPOWERMODE_STOP1))


/* Wake up pins check macro */
#if defined(STM32WBA50xx)
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WAKEUP_PIN1_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN3_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN4_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN1_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN3_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN4_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN1)         ||\
                                ((PIN) == PWR_WAKEUP_PIN3)         ||\
                                ((PIN) == PWR_WAKEUP_PIN4)         ||\
                                ((PIN) == PWR_WAKEUP_PIN6)         ||\
                                ((PIN) == PWR_WAKEUP_PIN7)         ||\
                                ((PIN) == PWR_WAKEUP_PIN8))
#endif /* defined(STM32WBA50xx) */
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx)
#if defined (STM32WBA55xx)
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WAKEUP_PIN1_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN1_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN2_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN2_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN3_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN3_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN4_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN4_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN5_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN5_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN1_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN1_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN2_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN2_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN3_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN3_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN4_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN4_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN5_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN5_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN1)         ||\
                                ((PIN) == PWR_WAKEUP_PIN2)         ||\
                                ((PIN) == PWR_WAKEUP_PIN3)         ||\
                                ((PIN) == PWR_WAKEUP_PIN4)         ||\
                                ((PIN) == PWR_WAKEUP_PIN5)         ||\
                                ((PIN) == PWR_WAKEUP_PIN6)         ||\
                                ((PIN) == PWR_WAKEUP_PIN7)         ||\
                                ((PIN) == PWR_WAKEUP_PIN8))
#else
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WAKEUP_PIN1_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN1_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN2_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN3_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN3_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN4_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN4_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN5_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN5_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN6_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_0)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN7_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_1)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_2)  ||\
                                ((PIN) == PWR_WAKEUP_PIN8_HIGH_3)  ||\
                                ((PIN) == PWR_WAKEUP_PIN1_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN1_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN2_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN3_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN3_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN4_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN4_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN5_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN5_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN6_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_0)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN7_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_1)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_2)   ||\
                                ((PIN) == PWR_WAKEUP_PIN8_LOW_3)   ||\
                                ((PIN) == PWR_WAKEUP_PIN1)         ||\
                                ((PIN) == PWR_WAKEUP_PIN2)         ||\
                                ((PIN) == PWR_WAKEUP_PIN3)         ||\
                                ((PIN) == PWR_WAKEUP_PIN4)         ||\
                                ((PIN) == PWR_WAKEUP_PIN5)         ||\
                                ((PIN) == PWR_WAKEUP_PIN6)         ||\
                                ((PIN) == PWR_WAKEUP_PIN7)         ||\
                                ((PIN) == PWR_WAKEUP_PIN8))
#endif /* defined (STM32WBA55xx) */
#endif /* defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) */

